AradhyaTyagiDev/NavigationWithUltrasonic/NavigationWithUltrasonic/platform/esp32/motor/TB6612FNG/src/TB6612Driver.cpp
//====================================================
// File: TB6612Driver.cpp
//====================================================

#include "motor/TB6612FNG/include/TB6612Driver.hpp"

#include "interfaces/include/synchronization/LockGuard.hpp"
#include "interfaces/include/logging/LoggerExtensions.hpp"
#include "interfaces/include/timing/ITimer.hpp"

#include <algorithm>
#include <cmath>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

//====================================================
// Constants
//====================================================

namespace
{
    constexpr const char *TAG = "TB6612Driver";
}

//====================================================
// Constructor
//====================================================

TB6612Driver::TB6612Driver(
    IMutex &mutex,
    ILogger &logger,
    ITimer &timer,
    const TB6612DriverConfig &config)
    : m_mutex(mutex), m_logger(logger), m_timer(timer), m_config(config)
{
    // Driver capabilities
    m_capabilities.supportsPWM = true;
    m_capabilities.supportsReverse = true;
    m_capabilities.supportsDualChannel = true;
    m_capabilities.supportsActiveBraking = true;
    m_capabilities.supportsEmergencyStop = true;
}

//====================================================
// Initialization
//====================================================

bool TB6612Driver::initialize()
{
    //-----------------------------------------
    // Initialize GPIO
    //-----------------------------------------

    if (!initializeGPIO())
    {
        Logger::error(
            m_logger,
            TAG,
            "Failed to initialize GPIO");

        return false;
    }

    //-----------------------------------------
    // Initialize PWM
    //-----------------------------------------

    if (!initializePWM())
    {
        Logger::error(
            m_logger,
            TAG,
            "Failed to initialize PWM");

        return false;
    }

    //-----------------------------------------
    // Safe startup state
    //-----------------------------------------

    stopAllMotors();

    setStandbyMode(false);

    //-----------------------------------------
    // Update memory
    //-----------------------------------------

    m_memory.initialized = true;

    transitionToState(MotorDriverState::Ready);

    Logger::info(
        m_logger,
        TAG,
        "TB6612 driver initialized");

    return true;
}

//====================================================
// Shutdown
//====================================================

void TB6612Driver::shutdown()
{
    stopAllMotors();

    setStandbyMode(false);

    transitionToState(MotorDriverState::Uninitialized);

    m_memory.initialized = false;

    Logger::info(
        m_logger,
        TAG,
        "TB6612 driver shutdown");
}

//====================================================
// GPIO Initialization
//====================================================

bool TB6612Driver::initializeGPIO()
{
    //-----------------------------------------
    // Configure output pins
    //-----------------------------------------

    const gpio_config_t config =
        {
            .pin_bit_mask =
                (1ULL << m_config.leftMotorIN1Pin) |
                (1ULL << m_config.leftMotorIN2Pin) |
                (1ULL << m_config.rightMotorIN1Pin) |
                (1ULL << m_config.rightMotorIN2Pin) |
                (1ULL << m_config.standbyPin),

            .mode = GPIO_MODE_OUTPUT,

            .pull_up_en = GPIO_PULLUP_DISABLE,

            .pull_down_en = GPIO_PULLDOWN_DISABLE,

            .intr_type = GPIO_INTR_DISABLE};

    const esp_err_t result =
        gpio_config(&config);

    if (result != ESP_OK)
    {
        Logger::error(
            m_logger,
            TAG,
            "GPIO configuration failed");

        return false;
    }

    //-----------------------------------------
    // Safe default states
    //-----------------------------------------

    gpio_set_level(
        m_config.leftMotorIN1Pin,
        0);

    gpio_set_level(
        m_config.leftMotorIN2Pin,
        0);

    gpio_set_level(
        m_config.rightMotorIN1Pin,
        0);

    gpio_set_level(
        m_config.rightMotorIN2Pin,
        0);

    gpio_set_level(
        m_config.standbyPin,
        0);

    return true;
}

//====================================================
// PWM Initialization
//====================================================

bool TB6612Driver::initializePWM()
{
    //-----------------------------------------
    // Timer configuration
    //-----------------------------------------

    const ledc_timer_config_t timerConfig =
        {
            .speed_mode =
                m_config.ledcMode,

            .duty_resolution =
                m_config.pwmResolution,

            .timer_num =
                m_config.pwmTimer,

            .freq_hz =
                static_cast<uint32_t>(
                    m_config.pwmFrequencyHz),

            .clk_cfg =
                LEDC_AUTO_CLK,

#if ESP_IDF_VERSION_MAJOR >= 5
            .deconfigure = false
#endif
        };

    if (
        ledc_timer_config(
            &timerConfig) != ESP_OK)
    {
        Logger::error(
            m_logger,
            TAG,
            "PWM timer config failed");

        return false;
    }

    //-----------------------------------------
    // Left PWM channel
    //-----------------------------------------

    ledc_channel_config_t leftChannel{};

    leftChannel.gpio_num = m_config.leftMotorPWMPin;
    leftChannel.speed_mode = m_config.ledcMode;
    leftChannel.channel = m_config.leftPWMChannel;
    leftChannel.intr_type = LEDC_INTR_DISABLE;
    leftChannel.timer_sel = m_config.pwmTimer;
    leftChannel.duty = 0;
    leftChannel.hpoint = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
    leftChannel.sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
    leftChannel.flags.output_invert = 0;
#endif

    //-----------------------------------------
    // Right PWM channel
    //-----------------------------------------

    ledc_channel_config_t rightChannel{};

    rightChannel.gpio_num = m_config.rightMotorPWMPin;
    rightChannel.speed_mode = m_config.ledcMode;
    rightChannel.channel = m_config.rightPWMChannel;
    rightChannel.intr_type = LEDC_INTR_DISABLE;
    rightChannel.timer_sel = m_config.pwmTimer;
    rightChannel.duty = 0;
    rightChannel.hpoint = 0;

