AradhyaTyagiDev/NavigationWithUltrasonic/NavigationWithUltrasonic/platform/esp32/motor/TB6612FNG/src/TB6612Driver.cpp
#if ESP_IDF_VERSION_MAJOR >= 5
    rightChannel.sleep_mode = LEDC_SLEEP_MODE_NO_ALIVE_NO_PD;
    rightChannel.flags.output_invert = 0;
#endif

    if (
        ledc_channel_config(
            &leftChannel) != ESP_OK)
    {
        return false;
    }

    if (
        ledc_channel_config(
            &rightChannel) != ESP_OK)
    {
        return false;
    }

    return true;
}

//====================================================
// Execute Command
//====================================================
void TB6612Driver::executeCommandInternal(const MotorDriverCommand &command)
{
    // Ready validation
    if (!isReady())
    {
        return;
    }

    // Emergency stop validation
    if (m_memory.emergencyStopActive)
    {
        return;
    }

    // Command emergency stop request
    if (command.emergencyStop)
    {
        applyEmergencyBrake();

        setStandbyMode(false);

        m_memory.emergencyStopActive = true;

        transitionToState(
            MotorDriverState::EmergencyStopped);

        m_memory.lastEmergencyBrakeTimestampMs = Timer::milliseconds(m_timer);

        Logger::warning(
            m_logger,
            TAG,
            "Emergency stop activated");

        return;
    }

    // Disabled motor output
    if (!command.enabled)
    {
        stopMotor(command.channel);
        return;
    }

    // Timestamp
    const uint32_t timestampMs = Timer::milliseconds(m_timer);

    // Update watchdog timestamp
    m_memory.lastCommandTimestampMs =
        timestampMs;

    // Enable standby
    setStandbyMode(true);

    // Direction transition validation
    if (
        !validateDirectionTransition(
            command.channel,
            command.direction,
            timestampMs))
    {
        m_memory.rejectedCommandCount++;

        return;
    }

    // Safe reverse sequence
    if (m_config.enableSafeReverseSequence)
    {
        performSafeReverseSequence(
            command.channel,
            command.direction);
    }
    else
    {
        applyMotorDirection(
            command.channel,
            command.direction);
    }

    // Convert normalized speed to PWM duty
    const float clampedSpeed =
        std::clamp(
            command.normalizedSpeed,
            0.0f,
            1.0f);

    uint32_t pwmDuty =
        static_cast<uint32_t>(
            clampedSpeed *
            static_cast<float>(m_config.maximumPWMDuty));

    // PWM validation
    pwmDuty =
        validatePWMDuty(
            pwmDuty);

    // Brake handling
    if (command.brakeMode != BrakeMode::Coast)
    {
        applyMotorBrake(
            command.channel,
            command.brakeMode);

        pwmDuty = 0;
    }

    // Deadzone compensation
    pwmDuty =
        applyDeadzoneCompensation(
            pwmDuty);

    // Startup boost
    pwmDuty =
        applyStartupBoost(
            command.channel,
            pwmDuty,
            timestampMs);

    // PWM ramping
    pwmDuty =
        applyPWMRamping(
            command.channel,
            pwmDuty);

    // Apply PWM
    applyPWMDuty(
        command.channel,
        pwmDuty);

    // Update runtime memory
    updateMotorMemory(
        command.channel,
        command.direction,
        pwmDuty,
        timestampMs);

    // Transition to running
    transitionToState(
        MotorDriverState::Running);

    // Statistics
    m_memory.executedCommandCount++;
}

void TB6612Driver::executeCommand(const MotorDriverCommand &command)
{
    LockGuard guard(m_mutex);
    executeCommandInternal(command);
}

// Execute Dual Commands
void TB6612Driver::executeDualCommand(
    const MotorDriverCommand &leftCommand,
    const MotorDriverCommand &rightCommand)
{
    LockGuard guard(m_mutex);

    // Execute left
    executeCommandInternal(leftCommand);
    // Execute right
    executeCommandInternal(rightCommand);

    // Synchronized commit
    if (
        m_config
            .enableSynchronizedDualMotorUpdate)
    {
        commitSynchronizedPWMUpdate();
    }
}

//====================================================
// Stop All Motors
//====================================================

void TB6612Driver::stopAllMotors()
{
    LockGuard guard(m_mutex);

    stopMotor(MotorChannel::Left);

    stopMotor(MotorChannel::Right);

    transitionToState(MotorDriverState::Ready);
}

//====================================================
// Emergency Stop
//====================================================

void TB6612Driver::emergencyStop()
{
    LockGuard guard(m_mutex);

    applyEmergencyBrake();

    setStandbyMode(false);

    m_memory.emergencyStopActive = true;

    transitionToState(MotorDriverState::EmergencyStopped);

    m_memory.lastEmergencyBrakeTimestampMs = Timer::milliseconds(m_timer);

    Logger::warning(
        m_logger,
        TAG,
        "Emergency stop activated");
}

//====================================================
// Clear Emergency Stop
//====================================================

void TB6612Driver::clearEmergencyStop()
{
    LockGuard guard(m_mutex);

    // Stop motors safely
    stopMotor(MotorChannel::Left);
    stopMotor(MotorChannel::Right);

    // Clear emergency state
    m_memory.emergencyStopActive = false;

    // Re-enable standby
    setStandbyMode(true);

    // Transition state
    transitionToState(MotorDriverState::Ready);

    Logger::info(
        m_logger,
        TAG,
        "Emergency stop cleared");
}

//====================================================
// Apply Brake Mode
//====================================================

void TB6612Driver::applyBrakeMode(BrakeMode brakeMode)
{
    LockGuard guard(m_mutex);

    applyMotorBrake(
        MotorChannel::Left,
        brakeMode);

    applyMotorBrake(
        MotorChannel::Right,
        brakeMode);

    m_memory.currentBrakeMode =
        brakeMode;
}

//====================================================
// Set Motor Direction
//====================================================

void TB6612Driver::setMotorDirection(
    MotorChannel channel,
    MotorDirection direction)
{
    LockGuard guard(m_mutex);

    applyMotorDirection(
        channel,
        direction);
}

