AradhyaTyagiDev/NavigationWithUltrasonic/NavigationWithUltrasonic/platform/esp32/motor/TB6612FNG/src/TB6612Driver.cpp
//====================================================
// Set PWM Duty
//====================================================

void TB6612Driver::setPWMDuty(
    MotorChannel channel,
    uint32_t pwmDuty)
{
    LockGuard guard(m_mutex);

    applyPWMDuty(
        channel,
        pwmDuty);
}

//====================================================
// Enable Motor
//====================================================

void TB6612Driver::enableMotor(
    MotorChannel channel)
{
    LockGuard guard(m_mutex);

    setStandbyMode(true);

    if (
        channel ==
        MotorChannel::Left)
    {
        m_memory.leftMotorEnabled = true;
    }
    else
    {
        m_memory.rightMotorEnabled = true;
    }
}

//====================================================
// Disable Motor
//====================================================

void TB6612Driver::disableMotor(
    MotorChannel channel)
{
    LockGuard guard(m_mutex);

    stopMotor(channel);

    if (
        channel ==
        MotorChannel::Left)
    {
        m_memory.leftMotorEnabled = false;
    }
    else
    {
        m_memory.rightMotorEnabled = false;
    }
}

//====================================================
// Driver State
//====================================================

bool TB6612Driver::isReady() const
{
    return (
        m_memory.initialized &&
        !m_memory.faultDetected &&
        !m_memory.emergencyStopActive);
}

//====================================================
// Fault State
//====================================================

bool TB6612Driver::hasFault() const
{
    return m_memory.faultDetected;
}

//====================================================
// Capabilities
//====================================================

MotorDriverCapabilities
TB6612Driver::getCapabilities() const
{
    return m_capabilities;
}

//====================================================
// Runtime Status
//====================================================

MotorDriverStatus
TB6612Driver::getStatus() const
{
    MotorDriverStatus status;

    status.state =
        m_memory.currentState;

    status.faultDetected =
        m_memory.faultDetected;

    status.emergencyStopActive =
        m_memory.emergencyStopActive;

    status.leftMotorRunning =
        (m_memory.currentLeftPWMDuty > 0);

    status.rightMotorRunning =
        (m_memory.currentRightPWMDuty > 0);

    status.currentLeftPWM =
        m_memory.currentLeftPWMDuty;

    status.currentRightPWM =
        m_memory.currentRightPWMDuty;

    status.lastUpdateTimestampMs =
        m_memory.lastUpdateTimestampMs;

    return status;
}

MotorDriverState TB6612Driver::getDriverState() const
{
    return m_memory.currentState;
}

//====================================================
// Hardware Type
//====================================================

MotorHardwareType
TB6612Driver::getHardwareType() const
{
    return MotorHardwareType::TB6612FNG;
}

//====================================================
// Standby Mode
//====================================================

void TB6612Driver::setStandbyMode(
    bool enabled)
{
    gpio_set_level(
        m_config.standbyPin,
        enabled ? 1 : 0);
}

//====================================================
// Apply Motor Direction
//====================================================

void TB6612Driver::applyMotorDirection(
    MotorChannel channel,
    MotorDirection direction)
{
    gpio_num_t in1 =
        getIN1Pin(channel);

    gpio_num_t in2 =
        getIN2Pin(channel);

    //-----------------------------------------
    // Motor inversion
    //-----------------------------------------

    bool inverted =
        isMotorInverted(channel);

    switch (direction)
    {
    case MotorDirection::Forward:

        gpio_set_level(
            in1,
            inverted ? 0 : 1);

        gpio_set_level(
            in2,
            inverted ? 1 : 0);

        break;

    case MotorDirection::Reverse:

        gpio_set_level(
            in1,
            inverted ? 1 : 0);

        gpio_set_level(
            in2,
            inverted ? 0 : 1);

        break;

    case MotorDirection::Brake:

        gpio_set_level(in1, 1);

        gpio_set_level(in2, 1);

        break;

    case MotorDirection::Stop:
    default:

        gpio_set_level(in1, 0);

        gpio_set_level(in2, 0);

        break;
    }
}

//====================================================
// Apply Motor Brake
//====================================================

void TB6612Driver::applyMotorBrake(
    MotorChannel channel,
    BrakeMode brakeMode)
{
    switch (brakeMode)
    {
    case BrakeMode::Active:

        applyMotorDirection(
            channel,
            MotorDirection::Brake);

        break;

    case BrakeMode::Emergency:

        applyMotorDirection(
            channel,
            MotorDirection::Brake);

        applyPWMDuty(
            channel,
            0);

        break;

    case BrakeMode::Coast:
    default:

        applyMotorDirection(
            channel,
            MotorDirection::Stop);

        applyPWMDuty(
            channel,
            0);

        break;
    }
}

//====================================================
// Apply PWM Duty
//====================================================

void TB6612Driver::applyPWMDuty(
    MotorChannel channel,
    uint32_t pwmDuty)
{
    const ledc_channel_t pwmChannel =
        getPWMChannel(channel);

    ledc_set_duty(
        m_config.ledcMode,
        pwmChannel,
        pwmDuty);

    commitPWMUpdate(channel);
}

//====================================================
// Validate PWM
//====================================================

uint32_t TB6612Driver::validatePWMDuty(
    uint32_t pwmDuty) const
{
    if (
        !m_config.enablePWMClamping)
    {
        return pwmDuty;
    }

    return std::clamp(
        pwmDuty,
        static_cast<uint32_t>(0),
        m_config.maximumPWMDuty);
}

//====================================================
// Deadzone Compensation
//====================================================

uint32_t
TB6612Driver::applyDeadzoneCompensation(
    uint32_t pwmDuty) const
{
    if (
        !m_config.enableDeadzoneCompensation)
    {
        return pwmDuty;
    }

    if (pwmDuty == 0)
    {
        return 0;
    }

    if (
        pwmDuty <
        m_config.minimumEffectivePWMDuty)
    {
        return m_config.minimumEffectivePWMDuty;
    }

    return pwmDuty;
}

