AradhyaTyagiDev/NavigationWithUltrasonic/NavigationWithUltrasonic/platform/esp32/motor/TB6612FNG/src/TB6612Driver.cpp
//====================================================
// Startup Boost
//====================================================

uint32_t TB6612Driver::applyStartupBoost(
    MotorChannel channel,
    uint32_t pwmDuty,
    uint32_t currentTimestampMs)
{
    if (
        !m_config.enableStartupBoost)
    {
        return pwmDuty;
    }

    if (pwmDuty == 0)
    {
        return 0;
    }

    bool startupActive = false;

    uint32_t lastStartup = 0;

    if (
        channel ==
        MotorChannel::Left)
    {
        startupActive = m_memory.leftStartupBoostActive;

        lastStartup =
            m_memory.lastLeftStartupTimestampMs;
    }
    else
    {
        startupActive =
            m_memory.rightStartupBoostActive;

        lastStartup =
            m_memory.lastRightStartupTimestampMs;
    }

    //-----------------------------------------
    // Startup boost duration
    //-----------------------------------------

    if (
        startupActive &&
        (currentTimestampMs -
         lastStartup) <
            m_config.startupBoostDurationMs)
    {
        return std::max(
            pwmDuty,
            m_config.startupBoostPWMDuty);
    }

    return pwmDuty;
}

//====================================================
// Direction Transition Validation
//====================================================

bool TB6612Driver::validateDirectionTransition(
    MotorChannel channel,
    MotorDirection newDirection,
    uint32_t currentTimestampMs)
{
    if (
        !m_config.enableSafeDirectionTransition)
    {
        return true;
    }

    MotorDirection currentDirection =
        MotorDirection::Stop;

    uint32_t lastTransition = 0;

    if (
        channel ==
        MotorChannel::Left)
    {
        currentDirection =
            m_memory.leftMotorDirection;

        lastTransition =
            m_memory
                .lastLeftDirectionChangeTimestampMs;
    }
    else
    {
        currentDirection =
            m_memory.rightMotorDirection;

        lastTransition =
            m_memory
                .lastRightDirectionChangeTimestampMs;
    }

    //-----------------------------------------
    // Forward -> reverse protection
    //-----------------------------------------

    const bool reversing =
        ((currentDirection ==
              MotorDirection::Forward &&
          newDirection ==
              MotorDirection::Reverse) ||
         (currentDirection ==
              MotorDirection::Reverse &&
          newDirection ==
              MotorDirection::Forward));

    if (!reversing)
    {
        return true;
    }

    //-----------------------------------------
    // Enforce delay
    //-----------------------------------------

    return (
        (
            currentTimestampMs -
            lastTransition) >=
        m_config.reverseTransitionDelayMs);
}

//====================================================
// Commit PWM Update
//====================================================

void TB6612Driver::commitPWMUpdate(
    MotorChannel channel)
{
    ledc_update_duty(
        m_config.ledcMode,
        getPWMChannel(channel));
}

//====================================================
// Commit Synchronized PWM Update
//====================================================

void TB6612Driver::commitSynchronizedPWMUpdate()
{
    ledc_update_duty(
        m_config.ledcMode,
        m_config.leftPWMChannel);

    ledc_update_duty(
        m_config.ledcMode,
        m_config.rightPWMChannel);
}

//====================================================
// Stop Single Motor
//====================================================

void TB6612Driver::stopMotor(
    MotorChannel channel)
{
    applyPWMDuty(channel, 0);

    applyMotorDirection(
        channel,
        MotorDirection::Stop);
}

//====================================================
// Emergency Brake
//====================================================

void TB6612Driver::applyEmergencyBrake()
{
    applyMotorBrake(
        MotorChannel::Left,
        BrakeMode::Emergency);

    applyMotorBrake(
        MotorChannel::Right,
        BrakeMode::Emergency);
}

//====================================================
// Update Runtime Memory
//====================================================

void TB6612Driver::updateMotorMemory(
    MotorChannel channel,
    MotorDirection direction,
    uint32_t pwmDuty,
    uint32_t currentTimestampMs)
{
    if (
        channel ==
        MotorChannel::Left)
    {
        m_memory.previousLeftPWMDuty =
            m_memory.currentLeftPWMDuty;

        m_memory.currentLeftPWMDuty =
            pwmDuty;

        m_memory.previousLeftMotorDirection =
            m_memory.leftMotorDirection;

        m_memory.leftMotorDirection =
            direction;

        m_memory
            .lastLeftDirectionChangeTimestampMs =
            currentTimestampMs;
    }
    else
    {
        m_memory.previousRightPWMDuty =
            m_memory.currentRightPWMDuty;

        m_memory.currentRightPWMDuty =
            pwmDuty;

        m_memory.previousRightMotorDirection =
            m_memory.rightMotorDirection;

        m_memory.rightMotorDirection =
            direction;

        m_memory
            .lastRightDirectionChangeTimestampMs =
            currentTimestampMs;
    }

    m_memory.lastUpdateTimestampMs =
        currentTimestampMs;
}

//====================================================
// Pin Mapping
//====================================================

gpio_num_t TB6612Driver::getIN1Pin(
    MotorChannel channel) const
{
    return (
               channel ==
               MotorChannel::Left)
               ? m_config.leftMotorIN1Pin
               : m_config.rightMotorIN1Pin;
}

//====================================================
// Pin Mapping
//====================================================

gpio_num_t TB6612Driver::getIN2Pin(
    MotorChannel channel) const
{
    return (
               channel ==
               MotorChannel::Left)
               ? m_config.leftMotorIN2Pin
               : m_config.rightMotorIN2Pin;
}

