AradhyaTyagiDev/NavigationWithUltrasonic/NavigationWithUltrasonic/platform/esp32/motor/TB6612FNG/src/TB6612Driver.cpp
//====================================================
// PWM Channel Mapping
//====================================================

ledc_channel_t
TB6612Driver::getPWMChannel(
    MotorChannel channel) const
{
    return (
               channel ==
               MotorChannel::Left)
               ? m_config.leftPWMChannel
               : m_config.rightPWMChannel;
}

//====================================================
// Motor Inversion
//====================================================
bool TB6612Driver::isMotorInverted(MotorChannel channel) const
{
    return (
               channel ==
               MotorChannel::Left)
               ? m_config.invertLeftMotor
               : m_config.invertRightMotor;
}

bool TB6612Driver::hasCommandTimedOut(uint32_t currentTimestampMs) const
{
    if (
        !m_config.enableCommandTimeoutProtection)
    {
        return false;
    }

    if (
        m_memory.lastCommandTimestampMs == 0)
    {
        return false;
    }

    return (
        (
            currentTimestampMs -
            m_memory.lastCommandTimestampMs) >
        m_config.commandTimeoutMs);
}

void TB6612Driver::handleCommandTimeout()
{
    Logger::error(
        m_logger,
        TAG,
        "Motor command timeout");

    applyEmergencyBrake();

    setStandbyMode(false);

    m_memory.emergencyStopActive = true;

    transitionToState(
        MotorDriverState::EmergencyStopped);

    m_memory.lastEmergencyBrakeTimestampMs = Timer::milliseconds(m_timer);
}

void TB6612Driver::update(uint32_t currentTimestampMs)
{
    LockGuard guard(m_mutex);

    //-----------------------------------------
    // Watchdog timeout
    //-----------------------------------------

    if (
        hasCommandTimedOut(
            currentTimestampMs))
    {
        handleCommandTimeout();
    }
}

void TB6612Driver::reset()
{
    LockGuard guard(m_mutex);

    stopMotor(MotorChannel::Left);

    stopMotor(MotorChannel::Right);

    m_memory = {};

    m_memory.initialized = true;

    transitionToState(
        MotorDriverState::Ready);
}

bool TB6612Driver::validateStateTransition(
    MotorDriverState currentState,
    MotorDriverState newState) const
{
    switch (currentState)
    {
    case MotorDriverState::Fault:

        return false;

    case MotorDriverState::EmergencyStopped:

        return (
            newState ==
            MotorDriverState::Ready);

    default:

        return true;
    }
}

void TB6612Driver::transitionToState(
    MotorDriverState newState)
{
    if (
        !validateStateTransition(
            m_memory.currentState,
            newState))
    {
        Logger::error(
            m_logger,
            TAG,
            "Invalid state transition");

        return;
    }

    m_memory.currentState =
        newState;
}

void TB6612Driver::performSafeReverseSequence(
    MotorChannel channel,
    MotorDirection newDirection)
{
    // Brake
    applyMotorBrake(
        channel,
        BrakeMode::Active);

    vTaskDelay(
        pdMS_TO_TICKS(
            m_config
                .safeReverseBrakeDurationMs));

    // Coast
    applyMotorDirection(
        channel,
        MotorDirection::Stop);

    vTaskDelay(
        pdMS_TO_TICKS(
            m_config
                .safeReverseCoastDurationMs));

    // Apply new direction
    applyMotorDirection(
        channel,
        newDirection);
}

uint32_t TB6612Driver::applyPWMRamping(MotorChannel channel, uint32_t targetPWMDuty)
{
    if (!m_config.enablePWMRamping)
    {
        return targetPWMDuty;
    }

    uint32_t currentDuty = 0;

    if (channel == MotorChannel::Left)
    {
        currentDuty =
            m_memory.currentLeftPWMDuty;
    }
    else
    {
        currentDuty =
            m_memory.currentRightPWMDuty;
    }

    // Ramp up
    if (targetPWMDuty > currentDuty)
    {
        return std::min(
            currentDuty +
                m_config.maximumPWMStepPerUpdate,
            targetPWMDuty);
    }

    // Ramp down
    return std::max(
        static_cast<int32_t>(currentDuty) -
            static_cast<int32_t>(
                m_config.maximumPWMStepPerUpdate),
        static_cast<int32_t>(targetPWMDuty));
}